; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v8 ?v3)
             (pred_6 ?v5 ?v9)
             (pred_7 ?v8 ?v9)
             (pred_9 ?v2 ?v8 )
	     (pred_8 ?v8)
             (pred_12 ?v1)
             (pred_5 ?v5)
             (pred_3 ?v9)
             (pred_1 ?v8)
             (pred_11 ?v5)
             (pred_4 ?v8)
             (pred_10 ))



(:action op_4
:parameters (?v7 ?v6 ?v13 ?v12)
:precondition (and (pred_12 ?v7) (pred_12 ?v6) (pred_5 ?v13) (pred_3 ?v12)
          (pred_2 ?v7 ?v6) (pred_6 ?v13 ?v12)
                   (pred_7 ?v6 ?v12) (pred_8 ?v7) 
                   (pred_1 ?v6) (pred_11 ?v13))
:effect (and  (pred_4 ?v6) (not (pred_1 ?v6))))


(:action op_1
:parameters (?v7 ?v11)
:precondition (and (pred_12 ?v7) (pred_12 ?v11)
               (pred_8 ?v7) (pred_2 ?v7 ?v11) (pred_4 ?v11))
:effect (and (pred_8 ?v11) (not (pred_8 ?v7))))

(:action op_5
:parameters (?v7 ?v13)
:precondition (and (pred_12 ?v7) (pred_5 ?v13) 
                  (pred_8 ?v7) (pred_9 ?v13 ?v7) (pred_10 ))
:effect (and (pred_11 ?v13)
   (not (pred_9 ?v13 ?v7)) (not (pred_10 ))))


(:action op_3
:parameters (?v7 ?v4 ?v10)
:precondition (and (pred_12 ?v7) (pred_5 ?v4) (pred_5 ?v10)
                  (pred_8 ?v7) (pred_11 ?v10) (pred_9 ?v4 ?v7))
:effect (and (pred_11 ?v4) (pred_9 ?v10 ?v7)
        (not (pred_11 ?v10)) (not (pred_9 ?v4 ?v7))))

(:action op_2
:parameters (?v7 ?v13)
:precondition (and (pred_12 ?v7) (pred_5 ?v13) 
                  (pred_8 ?v7) (pred_11 ?v13))
:effect (and (pred_10 ) (pred_9 ?v13 ?v7) (not (pred_11 ?v13)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_21 obj_11 obj_23 obj_26 obj_17 obj_07 obj_29 obj_25 obj_22 obj_09 obj_24 obj_14 obj_13 obj_19 obj_02 obj_03 obj_18 obj_08 obj_16 obj_10 obj_20 obj_30 obj_12 obj_27 obj_04
    obj_01 obj_31 obj_05
    obj_15 obj_28 obj_06
    )

    (:init
       (pred_10)

       (pred_12 obj_21)
       (pred_12 obj_11)
       (pred_12 obj_23)
       (pred_12 obj_26)
       (pred_12 obj_17)
       (pred_12 obj_07)
       (pred_12 obj_29)
       (pred_12 obj_25)
       (pred_12 obj_22)
       (pred_12 obj_09)
       (pred_12 obj_24)
       (pred_12 obj_14)
       (pred_12 obj_13)
       (pred_12 obj_19)
       (pred_12 obj_02)
       (pred_12 obj_03)
       (pred_12 obj_18)
       (pred_12 obj_08)
       (pred_12 obj_16)
       (pred_12 obj_10)
       (pred_12 obj_20)
       (pred_12 obj_30)
       (pred_12 obj_12)
       (pred_12 obj_27)
       (pred_12 obj_04)
       (pred_3 obj_01)
       (pred_3 obj_31)
       (pred_3 obj_05)
       (pred_5 obj_15)
       (pred_5 obj_28)
       (pred_5 obj_06)

       (pred_2 obj_21 obj_07)
       (pred_2 obj_21 obj_11)
       (pred_2 obj_11 obj_29)
       (pred_2 obj_11 obj_23)
       (pred_2 obj_11 obj_21)
       (pred_2 obj_23 obj_25)
       (pred_2 obj_23 obj_26)
       (pred_2 obj_23 obj_11)
       (pred_2 obj_26 obj_22)
       (pred_2 obj_26 obj_17)
       (pred_2 obj_26 obj_23)
       (pred_2 obj_17 obj_09)
       (pred_2 obj_17 obj_26)
       (pred_2 obj_07 obj_24)
       (pred_2 obj_07 obj_29)
       (pred_2 obj_07 obj_21)
       (pred_2 obj_29 obj_14)
       (pred_2 obj_29 obj_25)
       (pred_2 obj_29 obj_11)
       (pred_2 obj_29 obj_07)
       (pred_2 obj_25 obj_13)
       (pred_2 obj_25 obj_22)
       (pred_2 obj_25 obj_23)
       (pred_2 obj_25 obj_29)
       (pred_2 obj_22 obj_19)
       (pred_2 obj_22 obj_09)
       (pred_2 obj_22 obj_26)
       (pred_2 obj_22 obj_25)
       (pred_2 obj_09 obj_02)
       (pred_2 obj_09 obj_17)
       (pred_2 obj_09 obj_22)
       (pred_2 obj_24 obj_03)
       (pred_2 obj_24 obj_14)
       (pred_2 obj_24 obj_07)
       (pred_2 obj_14 obj_18)
       (pred_2 obj_14 obj_13)
       (pred_2 obj_14 obj_29)
       (pred_2 obj_14 obj_24)
       (pred_2 obj_13 obj_08)
       (pred_2 obj_13 obj_19)
       (pred_2 obj_13 obj_25)
       (pred_2 obj_13 obj_14)
       (pred_2 obj_19 obj_16)
       (pred_2 obj_19 obj_02)
       (pred_2 obj_19 obj_22)
       (pred_2 obj_19 obj_13)
       (pred_2 obj_02 obj_10)
       (pred_2 obj_02 obj_09)
       (pred_2 obj_02 obj_19)
       (pred_2 obj_03 obj_20)
       (pred_2 obj_03 obj_18)
       (pred_2 obj_03 obj_24)
       (pred_2 obj_18 obj_30)
       (pred_2 obj_18 obj_08)
       (pred_2 obj_18 obj_14)
       (pred_2 obj_18 obj_03)
       (pred_2 obj_08 obj_12)
       (pred_2 obj_08 obj_16)
       (pred_2 obj_08 obj_13)
       (pred_2 obj_08 obj_18)
       (pred_2 obj_16 obj_27)
       (pred_2 obj_16 obj_10)
       (pred_2 obj_16 obj_19)
       (pred_2 obj_16 obj_08)
       (pred_2 obj_10 obj_04)
       (pred_2 obj_10 obj_02)
       (pred_2 obj_10 obj_16)
       (pred_2 obj_20 obj_30)
       (pred_2 obj_20 obj_03)
       (pred_2 obj_30 obj_12)
       (pred_2 obj_30 obj_18)
       (pred_2 obj_30 obj_20)
       (pred_2 obj_12 obj_27)
       (pred_2 obj_12 obj_08)
       (pred_2 obj_12 obj_30)
       (pred_2 obj_27 obj_04)
       (pred_2 obj_27 obj_16)
       (pred_2 obj_27 obj_12)
       (pred_2 obj_04 obj_10)
       (pred_2 obj_04 obj_27)
       (pred_1 obj_09)
       (pred_1 obj_13)
       (pred_1 obj_11)
       (pred_7  obj_09 obj_01)
       (pred_7  obj_13 obj_31)
       (pred_7  obj_11 obj_05)
       (pred_4 obj_21)
       (pred_4 obj_23)
       (pred_4 obj_26)
       (pred_4 obj_17)
       (pred_4 obj_07)
       (pred_4 obj_29)
       (pred_4 obj_25)
       (pred_4 obj_22)
       (pred_4 obj_24)
       (pred_4 obj_14)
       (pred_4 obj_19)
       (pred_4 obj_02)
       (pred_4 obj_03)
       (pred_4 obj_18)
       (pred_4 obj_08)
       (pred_4 obj_16)
       (pred_4 obj_10)
       (pred_4 obj_20)
       (pred_4 obj_30)
       (pred_4 obj_12)
       (pred_4 obj_27)
       (pred_4 obj_04)

       (pred_6  obj_15 obj_01)
       (pred_6  obj_28 obj_31)
       (pred_6  obj_06 obj_05)
       (pred_9 obj_15 obj_27)
       (pred_9 obj_28 obj_21)
       (pred_9 obj_06 obj_18)
       (pred_8 obj_02)
    )

    (:goal (and
       (pred_9 obj_15 obj_12)
       (pred_9 obj_06 obj_16)
    ))
(:constraints
  (always (not (pred_8 obj_08)))
)
)

; plan
1. (op_1 obj_02 obj_19)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_19)
   goals met: 0 of 2
2. (op_1 obj_19 obj_16)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_16)
   goals met: 0 of 2
3. (op_1 obj_16 obj_27)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_27)
   goals met: 0 of 2
4. (op_5 obj_27 obj_15)
   deleted: (pred_9 obj_15 obj_27) (pred_10)
   added: (pred_11 obj_15)
   goals met: 0 of 2
5. (op_1 obj_27 obj_12)
   deleted: (pred_8 obj_27)
   added: (pred_8 obj_12)
   goals met: 0 of 2
6. (op_2 obj_12 obj_15)
   deleted: (pred_11 obj_15)
   added: (pred_10) (pred_9 obj_15 obj_12)
   goals met: 1 of 2
7. (op_1 obj_12 obj_30)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_30)
   goals met: 1 of 2
8. (op_1 obj_30 obj_18)
   deleted: (pred_8 obj_30)
   added: (pred_8 obj_18)
   goals met: 1 of 2
9. (op_5 obj_18 obj_06)
   deleted: (pred_9 obj_06 obj_18) (pred_10)
   added: (pred_11 obj_06)
   goals met: 1 of 2
10. (op_1 obj_18 obj_30)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_30)
   goals met: 1 of 2
11. (op_1 obj_30 obj_12)
   deleted: (pred_8 obj_30)
   added: (pred_8 obj_12)
   goals met: 1 of 2
12. (op_1 obj_12 obj_27)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_27)
   goals met: 1 of 2
13. (op_1 obj_27 obj_16)
   deleted: (pred_8 obj_27)
   added: (pred_8 obj_16)
   goals met: 1 of 2
14. (op_2 obj_16 obj_06)
   deleted: (pred_11 obj_06)
   added: (pred_10) (pred_9 obj_06 obj_16)
   goals met: 2 of 2
